mamedev/mame/src/devices/cpu/tms320c1x/tms320c1x.cpp
// license:BSD-3-Clause
// copyright-holders:Tony La Porta
/**************************************************************************

    Texas Instruments TMS320C1x DSP Emulator

    Copyright Tony La Porta

    Notes:
    * The term 'DMA' within this document, is in reference to Direct
      Memory Addressing, and NOT the usual term of Direct Memory Access.
    * This is a word based microcontroller, with addressing architecture
      based on the Harvard addressing scheme.

**************************************************************************/


#include "emu.h"
#include "tms320c1x.h"

#include "tms320c1x_dasm.h"



#define M_RDROM(A)      TMS320C1X_ROM_RDMEM(A)
#define M_WRTROM(A,V)   TMS320C1X_ROM_WRMEM(A,V)
#define M_RDRAM(A)      TMS320C1X_RAM_RDMEM(A)
#define M_WRTRAM(A,V)   TMS320C1X_RAM_WRMEM(A,V)
#define M_RDOP(A)       TMS320C1X_RDOP(A)
#define M_RDOP_ARG(A)   TMS320C1X_RDOP_ARG(A)
#define P_IN(A)         TMS320C1X_In(A)
#define P_OUT(A,V)      TMS320C1X_Out(A,V)


DEFINE_DEVICE_TYPE(TMS320C10, tms320c10_device, "tms320c10", "Texas Instruments TMS320C10")
DEFINE_DEVICE_TYPE(TMS320C15, tms320c15_device, "tms320c15", "Texas Instruments TMS320C15")
DEFINE_DEVICE_TYPE(TMS320C16, tms320c16_device, "tms320c16", "Texas Instruments TMS320C16")


/****************************************************************************
 *  TMS320C1x Internal Memory Map
 ****************************************************************************/

template <int HighBits>
void tms320c1x_device_base<HighBits>::tms320c10_ram(address_map &map)
{
	map(0x00, 0x7f).ram();     /* Page 0 */
	map(0x80, 0x8f).ram();     /* Page 1 */
}

/****************************************************************************
 *  TMS320C15/6 Internal Memory Map
 ****************************************************************************/

template <int HighBits>
void tms320c1x_device_base<HighBits>::tms320c15_ram(address_map &map)
{
	map(0x00, 0x7f).ram();     /* Page 0 */
	map(0x80, 0xff).ram();     /* Page 1 */
}


template <int HighBits>
tms320c1x_device_base<HighBits>::tms320c1x_device_base(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock, address_map_constructor data_map)
	: cpu_device(mconfig, type, tag, owner, clock)
	, m_program_config("program", ENDIANNESS_BIG, 16, HighBits, -1)
	, m_data_config("data", ENDIANNESS_BIG, 16, 8, -1, data_map)
	, m_io_config("io", ENDIANNESS_BIG, 16, 4, -1)
	, m_bio_in(*this, 0)
	, m_addr_mask(util::make_bitmask<uint32_t>(HighBits))
{
}


tms320c10_device::tms320c10_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c1x_device_base(mconfig, TMS320C10, tag, owner, clock, address_map_constructor(FUNC(tms320c10_device::tms320c10_ram), this))
{
}


tms320c15_device::tms320c15_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c1x_device_base(mconfig, TMS320C15, tag, owner, clock, address_map_constructor(FUNC(tms320c15_device::tms320c15_ram), this))
{
}


tms320c16_device::tms320c16_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms320c1x_device_base(mconfig, TMS320C16, tag, owner, clock, address_map_constructor(FUNC(tms320c16_device::tms320c15_ram), this))
{
}

template <int HighBits>
device_memory_interface::space_config_vector tms320c1x_device_base<HighBits>::memory_space_config() const
{
	return space_config_vector {
		std::make_pair(AS_PROGRAM, &m_program_config),
		std::make_pair(AS_DATA,    &m_data_config),
		std::make_pair(AS_IO,      &m_io_config)
	};
}

template <int HighBits>
std::unique_ptr<util::disasm_interface> tms320c1x_device_base<HighBits>::create_disassembler()
{
	return std::make_unique<tms320c1x_disassembler>();
}


/*********  The following is the Status (Flag) register definition.  *********/
/* 15 | 14  |  13  | 12 | 11 | 10 | 9 |  8  | 7 | 6 | 5 | 4 | 3 | 2 | 1 | 0  */
/* OV | OVM | INTM |  1 |  1 |  1 | 1 | ARP | 1 | 1 | 1 | 1 | 1 | 1 | 1 | DP */
#define OV_FLAG     0x8000  /* OV   (Overflow flag) 1 indicates an overflow */
#define OVM_FLAG    0x4000  /* OVM  (Overflow Mode bit) 1 forces ACC overflow to greatest positive or negative saturation value */
#define INTM_FLAG   0x2000  /* INTM (Interrupt Mask flag) 0 enables maskable interrupts */
#define ARP_REG     0x0100  /* ARP  (Auxiliary Register Pointer) */
#define DP_REG      0x0001  /* DP   (Data memory Pointer (bank) bit) */

#define OV      ( m_STR & OV_FLAG)          /* OV   (Overflow flag) */
#define OVM     ( m_STR & OVM_FLAG)         /* OVM  (Overflow Mode bit) 1 indicates an overflow */
#define INTM    ( m_STR & INTM_FLAG)        /* INTM (Interrupt enable flag) 0 enables maskable interrupts */
#define ARP     ((m_STR & ARP_REG) >> 8)    /* ARP  (Auxiliary Register Pointer) */
#define DP      ((m_STR & DP_REG) << 7)     /* DP   (Data memory Pointer bit) */

#define DMA_DP  (DP | (m_opcode.b.l & 0x7f))    /* address used in direct memory access operations */
#define DMA_DP1 (0x80 | m_opcode.b.l)           /* address used in direct memory access operations for sst instruction */
#define IND     (m_AR[ARP] & 0xff)              /* address used in indirect memory access operations */


/****************************************************************************
 *  Input a word from given I/O port
 */

#define TMS320C1X_In(Port) (m_io.read_word(Port))


/****************************************************************************
 *  Output a word to given I/O port
 */

#define TMS320C1X_Out(Port,Value) (m_io.write_word(Port,Value))



/****************************************************************************
 *  Read a word from given ROM memory location
 */

#define TMS320C1X_ROM_RDMEM(A) (m_program.read_word(A))


/****************************************************************************
 *  Write a word to given ROM memory location
 */

#define TMS320C1X_ROM_WRMEM(A,V) (m_program.write_word(A,V))



/****************************************************************************
 *  Read a word from given RAM memory location
 */

#define TMS320C1X_RAM_RDMEM(A) (m_data.read_word(A))


/****************************************************************************
 *  Write a word to given RAM memory location
 */

#define TMS320C1X_RAM_WRMEM(A,V) (m_data.write_word(A,V))



/****************************************************************************
 *  TMS320C1X_RDOP() is identical to TMS320C1X_RDMEM() except it is used for reading
 *  opcodes. In case of system with memory mapped I/O, this function can be
 *  used to greatly speed up emulation
 */

#define TMS320C1X_RDOP(A) (m_cache.read_word(A))


/****************************************************************************
 *  TMS320C1X_RDOP_ARG() is identical to TMS320C1X_RDOP() except it is used
 *  for reading opcode arguments. This difference can be used to support systems
 *  that use different encoding mechanisms for opcodes and opcode arguments
 */

#define TMS320C1X_RDOP_ARG(A) (m_cache.read_word(A))


/************************************************************************
 *  Shortcuts
 ************************************************************************/

template <int HighBits>
void tms320c1x_device_base<HighBits>::CLR(uint16_t flag) { m_STR &= ~flag; m_STR |= 0x1efe; }
template <int HighBits>
void tms320c1x_device_base<HighBits>::SET_FLAG(uint16_t flag) { m_STR |=  flag; m_STR |= 0x1efe; }


template <int HighBits>
void tms320c1x_device_base<HighBits>::CALCULATE_ADD_OVERFLOW(int32_t addval)
{
	if (int32_t(~(m_oldacc.d ^ addval) & (m_oldacc.d ^ m_ACC.d)) < 0) {
		SET_FLAG(OV_FLAG);
		if (OVM)
			m_ACC.d = ((int32_t)m_oldacc.d < 0) ? 0x80000000 : 0x7fffffff;
	}
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::CALCULATE_SUB_OVERFLOW(int32_t subval)
{
	if (int32_t((m_oldacc.d ^ subval) & (m_oldacc.d ^ m_ACC.d)) < 0) {
		SET_FLAG(OV_FLAG);
		if (OVM)
			m_ACC.d = ((int32_t)m_oldacc.d < 0) ? 0x80000000 : 0x7fffffff;
	}
}

template <int HighBits>
uint16_t tms320c1x_device_base<HighBits>::POP_STACK()
{
	uint16_t data = m_STACK[3];
	m_STACK[3] = m_STACK[2];
	m_STACK[2] = m_STACK[1];
	m_STACK[1] = m_STACK[0];
	return (data & m_addr_mask);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::PUSH_STACK(uint16_t data)
{
	m_STACK[0] = m_STACK[1];
	m_STACK[1] = m_STACK[2];
	m_STACK[2] = m_STACK[3];
	m_STACK[3] = (data & m_addr_mask);
}

template <int HighBits>
void tms320c1x_device_base<HighBits>::UPDATE_AR()
{
	if (m_opcode.b.l & 0x30) {
		uint16_t tmpAR = m_AR[ARP];
		if (m_opcode.b.l & 0x20) tmpAR++ ;
		if (m_opcode.b.l & 0x10) tmpAR-- ;
		m_AR[ARP] = (m_AR[ARP] & 0xfe00) | (tmpAR & 0x01ff);
	}
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::UPDATE_ARP()
{
	if (~m_opcode.b.l & 0x08) {
		if (m_opcode.b.l & 0x01) SET_FLAG(ARP_REG);
		else CLR(ARP_REG);
	}
}


template <int HighBits>
void tms320c1x_device_base<HighBits>::getdata(uint8_t shift,uint8_t signext)
{
	if (m_opcode.b.l & 0x80)
		m_memaccess = IND;
	else
		m_memaccess = DMA_DP;

