mamedev/mame/src/devices/cpu/tms320c1x/tms320c1x.cpp
	m_ALU.d = (uint16_t)M_RDRAM(m_memaccess);
	if (signext) m_ALU.d = (int16_t)m_ALU.d;
	m_ALU.d <<= shift;
	if (m_opcode.b.l & 0x80) {
		UPDATE_AR();
		UPDATE_ARP();
	}
}

template <int HighBits>
void tms320c1x_device_base<HighBits>::putdata(uint16_t data)
{
	if (m_opcode.b.l & 0x80)
		m_memaccess = IND;
	else
		m_memaccess = DMA_DP;

	if (m_opcode.b.l & 0x80) {
		UPDATE_AR();
		UPDATE_ARP();
	}
	M_WRTRAM(m_memaccess,data);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::putdata_sar(uint8_t data)
{
	if (m_opcode.b.l & 0x80)
		m_memaccess = IND;
	else
		m_memaccess = DMA_DP;

	if (m_opcode.b.l & 0x80) {
		UPDATE_AR();
		UPDATE_ARP();
	}
	M_WRTRAM(m_memaccess,m_AR[data]);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::putdata_sst(uint16_t data)
{
	if (m_opcode.b.l & 0x80)
		m_memaccess = IND;
	else
		m_memaccess = DMA_DP1;  /* Page 1 only */

	if (m_opcode.b.l & 0x80) {
		UPDATE_AR();
	}
	M_WRTRAM(m_memaccess,data);
}



/************************************************************************
 *  Emulate the Instructions
 ************************************************************************/

/* This following function is here to fill in the void for */
/* the opcode call function. This function is never called. */

template <int HighBits>
void tms320c1x_device_base<HighBits>::opcodes_7F()
{
	fatalerror("Should never get here!\n");
}


template <int HighBits>
void tms320c1x_device_base<HighBits>::illegal()
{
	logerror("TMS320C1x:  PC=%04x,  Illegal opcode = %04x\n", (m_PC-1), m_opcode.w.l);
}

template <int HighBits>
void tms320c1x_device_base<HighBits>::abst()
{
	if (int32_t(m_ACC.d) < 0) {
		m_ACC.d = -m_ACC.d;
		if (OVM && (m_ACC.d == 0x80000000)) m_ACC.d-- ;
	}
}

/*** The manual doesn't mention overflow with the ADD? instructions however ***
 *** overflow is implemented here, because it makes little sense otherwise ****
 *** while newer generations of this type of chip supported it. The ***********
 *** manual may be wrong wrong (apart from other errors the manual has). ******

template <int HighBits>
void tms320c1x_device_base<HighBits>::add_sh()    { getdata(m_opcode.b.h,1); m_ACC.d += m_ALU.d; }
template <int HighBits>
void tms320c1x_device_base<HighBits>::addh()      { getdata(0,0); m_ACC.d += (m_ALU.d << 16); }
 ***/

template <int HighBits>
void tms320c1x_device_base<HighBits>::add_sh()
{
	m_oldacc.d = m_ACC.d;
	getdata((m_opcode.b.h & 0xf),1);
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::addh()
{
	m_oldacc.d = m_ACC.d;
	getdata(0,0);
	m_ACC.w.h += m_ALU.w.l;
	if (int16_t(~(m_oldacc.w.h ^ m_ALU.w.h) & (m_oldacc.w.h ^ m_ACC.w.h)) < 0) {
		SET_FLAG(OV_FLAG);
		if (OVM)
			m_ACC.w.h = ((int16_t)m_oldacc.w.h < 0) ? 0x8000 : 0x7fff;
	}
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::adds()
{
	m_oldacc.d = m_ACC.d;
	getdata(0,0);
	m_ACC.d += m_ALU.d;
	CALCULATE_ADD_OVERFLOW(m_ALU.d);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::and_()
{
	getdata(0,0);
	m_ACC.d &= m_ALU.d;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::apac()
{
	m_oldacc.d = m_ACC.d;
	m_ACC.d += m_Preg.d;
	CALCULATE_ADD_OVERFLOW(m_Preg.d);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::br()
{
	m_PC = M_RDOP_ARG(m_PC);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::banz()
{
	if (m_AR[ARP] & 0x01ff) {
		m_PC = M_RDOP_ARG(m_PC);
		m_icount -= add_branch_cycle();
	}
	else
		m_PC++ ;
	m_ALU.w.l = m_AR[ARP];
	m_ALU.w.l-- ;
	m_AR[ARP] = (m_AR[ARP] & 0xfe00) | (m_ALU.w.l & 0x01ff);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::bgez()
{
	if (int32_t(m_ACC.d) >= 0) {
		m_PC = M_RDOP_ARG(m_PC);
		m_icount -= add_branch_cycle();
	}
	else
		m_PC++ ;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::bgz()
{
	if (int32_t(m_ACC.d) > 0) {
		m_PC = M_RDOP_ARG(m_PC);
		m_icount -= add_branch_cycle();
	}
	else
		m_PC++ ;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::bioz()
{
	if (m_bio_in() != CLEAR_LINE) {
		m_PC = M_RDOP_ARG(m_PC);
		m_icount -= add_branch_cycle();
	}
	else
		m_PC++ ;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::blez()
{
	if (int32_t(m_ACC.d) <= 0) {
		m_PC = M_RDOP_ARG(m_PC);
		m_icount -= add_branch_cycle();
	}
	else
		m_PC++ ;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::blz()
{
	if (int32_t(m_ACC.d) <  0) {
		m_PC = M_RDOP_ARG(m_PC);
		m_icount -= add_branch_cycle();
	}
	else
		m_PC++ ;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::bnz()
{
	if (m_ACC.d != 0) {
		m_PC = M_RDOP_ARG(m_PC);
		m_icount -= add_branch_cycle();
	}
	else
		m_PC++ ;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::bv()
{
	if (OV) {
		CLR(OV_FLAG);
		m_PC = M_RDOP_ARG(m_PC);
		m_icount -= add_branch_cycle();
	}
	else
		m_PC++ ;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::bz()
{
	if (m_ACC.d == 0) {
		m_PC = M_RDOP_ARG(m_PC);
		m_icount -= add_branch_cycle();
	}
	else
		m_PC++ ;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::cala()
{
	PUSH_STACK(m_PC);
	m_PC = m_ACC.w.l & m_addr_mask;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::call()
{
	m_PC++ ;
	PUSH_STACK(m_PC);
	m_PC = M_RDOP_ARG((m_PC - 1));
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::dint()
{
	SET_FLAG(INTM_FLAG);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::dmov()
{
	getdata(0,0);
	M_WRTRAM((m_memaccess + 1),m_ALU.w.l);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::eint()
{
	CLR(INTM_FLAG);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::in_p()
{
	m_ALU.w.l = P_IN(m_opcode.b.h & 7);
	putdata(m_ALU.w.l);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::lac_sh()
{
	getdata((m_opcode.b.h & 0x0f),1);
	m_ACC.d = m_ALU.d;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::lack()
{
	m_ACC.d = m_opcode.b.l;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::lar_ar0()
{
	getdata(0,0);
	m_AR[0] = m_ALU.w.l;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::lar_ar1()
{
	getdata(0,0);
	m_AR[1] = m_ALU.w.l;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::lark_ar0()
{
	m_AR[0] = m_opcode.b.l;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::lark_ar1()
{
	m_AR[1] = m_opcode.b.l;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::larp_mar()
{
	if (m_opcode.b.l & 0x80) {
		UPDATE_AR();
		UPDATE_ARP();
	}
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::ldp()
{
	getdata(0,0);
	if (m_ALU.d & 1)
		SET_FLAG(DP_REG);
	else
		CLR(DP_REG);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::ldpk()
{
	if (m_opcode.b.l & 1)
		SET_FLAG(DP_REG);
	else
		CLR(DP_REG);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::lst()
{
	if (m_opcode.b.l & 0x80) {
		m_opcode.b.l |= 0x08; /* In Indirect Addressing mode, next ARP is not supported here so mask it */
	}
	getdata(0,0);
	m_ALU.w.l &= (~INTM_FLAG);  /* Must not affect INTM */
	m_STR &= INTM_FLAG;
	m_STR |= m_ALU.w.l;
	m_STR |= 0x1efe;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::lt()
{
	getdata(0,0);
	m_Treg = m_ALU.w.l;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::lta()
{
	m_oldacc.d = m_ACC.d;
	getdata(0,0);
	m_Treg = m_ALU.w.l;
	m_ACC.d += m_Preg.d;
	CALCULATE_ADD_OVERFLOW(m_Preg.d);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::ltd()
{
	m_oldacc.d = m_ACC.d;
	getdata(0,0);
	m_Treg = m_ALU.w.l;
	M_WRTRAM((m_memaccess + 1),m_ALU.w.l);
	m_ACC.d += m_Preg.d;
	CALCULATE_ADD_OVERFLOW(m_Preg.d);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::mpy()
{
	getdata(0,0);
	m_Preg.d = (int16_t)m_ALU.w.l * (int16_t)m_Treg;
	if (m_Preg.d == 0x40000000) m_Preg.d = 0xc0000000;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::mpyk()
{
	m_Preg.d = (int16_t)m_Treg * (int16_t(m_opcode.w.l << 3) >> 3);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::nop()
{
	/* Nothing to do */
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::or_()
{
	getdata(0,0);
	m_ACC.w.l |= m_ALU.w.l;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::out_p()
{
	getdata(0,0);
	P_OUT( (m_opcode.b.h & 7), m_ALU.w.l );
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::pac()
{
	m_ACC.d = m_Preg.d;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::pop()
{
	m_ACC.w.l = POP_STACK();
	m_ACC.w.h = 0x0000;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::push()
{
	PUSH_STACK(m_ACC.w.l);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::ret()
{
	m_PC = POP_STACK();
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::rovm()
{
	CLR(OVM_FLAG);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::sach_sh()
{
	m_ALU.d = (m_ACC.d << (m_opcode.b.h & 7));
	putdata(m_ALU.w.h);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::sacl()
{
	putdata(m_ACC.w.l);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::sar_ar0()
{
	putdata_sar(0);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::sar_ar1()
{
	putdata_sar(1);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::sovm()
{
	SET_FLAG(OVM_FLAG);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::spac()
{
	m_oldacc.d = m_ACC.d;
	m_ACC.d -= m_Preg.d;
	CALCULATE_SUB_OVERFLOW(m_Preg.d);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::sst()
{
	putdata_sst(m_STR);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::sub_sh()
{
	m_oldacc.d = m_ACC.d;
	getdata((m_opcode.b.h & 0x0f),1);
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::subc()
{
	m_oldacc.d = m_ACC.d;
	getdata(15,0);
	m_ALU.d = (int32_t) m_ACC.d - m_ALU.d;
	if (int32_t((m_oldacc.d ^ m_ALU.d) & (m_oldacc.d ^ m_ACC.d)) < 0)
		SET_FLAG(OV_FLAG);
	if (int32_t(m_ALU.d) >= 0)
		m_ACC.d = (m_ALU.d << 1) + 1;
	else
		m_ACC.d = m_ACC.d << 1;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::subh()
{
	m_oldacc.d = m_ACC.d;
	getdata(16,0);
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::subs()
{
	m_oldacc.d = m_ACC.d;
	getdata(0,0);
	m_ACC.d -= m_ALU.d;
	CALCULATE_SUB_OVERFLOW(m_ALU.d);
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::tblr()
{
	m_ALU.d = M_RDROM((m_ACC.w.l & m_addr_mask));
	putdata(m_ALU.w.l);
	m_STACK[0] = m_STACK[1];
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::tblw()
{
	getdata(0,0);
	M_WRTROM(((m_ACC.w.l & m_addr_mask)),m_ALU.w.l);
	m_STACK[0] = m_STACK[1];
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::xor_()
{
	getdata(0,0);
	m_ACC.w.l ^= m_ALU.w.l;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::zac()
{
	m_ACC.d = 0;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::zalh()
{
	getdata(0,0);
	m_ACC.w.h = m_ALU.w.l;
	m_ACC.w.l = 0x0000;
}
template <int HighBits>
void tms320c1x_device_base<HighBits>::zals()
{
	getdata(0,0);
	m_ACC.w.l = m_ALU.w.l;
	m_ACC.w.h = 0x0000;
}



/***********************************************************************
 *  Opcode Table (Cycles, Instruction)
 ***********************************************************************/

/* Conditional Branch instructions take two cycles when the test condition is met and the branch performed */

template <int HighBits>
const typename tms320c1x_device_base<HighBits>::tms320c1x_opcode tms320c1x_device_base<HighBits>::s_opcode_main[256]=
{
/*00*/  {1, &tms320c1x_device_base::add_sh  },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },
/*08*/  {1, &tms320c1x_device_base::add_sh  },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },{1, &tms320c1x_device_base::add_sh    },
/*10*/  {1, &tms320c1x_device_base::sub_sh  },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },
/*18*/  {1, &tms320c1x_device_base::sub_sh  },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },{1, &tms320c1x_device_base::sub_sh    },
/*20*/  {1, &tms320c1x_device_base::lac_sh  },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },
/*28*/  {1, &tms320c1x_device_base::lac_sh  },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },{1, &tms320c1x_device_base::lac_sh    },
/*30*/  {1, &tms320c1x_device_base::sar_ar0 },{1, &tms320c1x_device_base::sar_ar1   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*38*/  {1, &tms320c1x_device_base::lar_ar0 },{1, &tms320c1x_device_base::lar_ar1   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*40*/  {2, &tms320c1x_device_base::in_p    },{2, &tms320c1x_device_base::in_p      },{2, &tms320c1x_device_base::in_p      },{2, &tms320c1x_device_base::in_p      },{2, &tms320c1x_device_base::in_p      },{2, &tms320c1x_device_base::in_p      },{2, &tms320c1x_device_base::in_p      },{2, &tms320c1x_device_base::in_p      },
/*48*/  {2, &tms320c1x_device_base::out_p   },{2, &tms320c1x_device_base::out_p     },{2, &tms320c1x_device_base::out_p     },{2, &tms320c1x_device_base::out_p     },{2, &tms320c1x_device_base::out_p     },{2, &tms320c1x_device_base::out_p     },{2, &tms320c1x_device_base::out_p     },{2, &tms320c1x_device_base::out_p     },
/*50*/  {1, &tms320c1x_device_base::sacl    },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*58*/  {1, &tms320c1x_device_base::sach_sh },{1, &tms320c1x_device_base::sach_sh   },{1, &tms320c1x_device_base::sach_sh   },{1, &tms320c1x_device_base::sach_sh   },{1, &tms320c1x_device_base::sach_sh   },{1, &tms320c1x_device_base::sach_sh   },{1, &tms320c1x_device_base::sach_sh   },{1, &tms320c1x_device_base::sach_sh   },
/*60*/  {1, &tms320c1x_device_base::addh    },{1, &tms320c1x_device_base::adds      },{1, &tms320c1x_device_base::subh      },{1, &tms320c1x_device_base::subs      },{1, &tms320c1x_device_base::subc      },{1, &tms320c1x_device_base::zalh      },{1, &tms320c1x_device_base::zals      },{3, &tms320c1x_device_base::tblr      },
/*68*/  {1, &tms320c1x_device_base::larp_mar},{1, &tms320c1x_device_base::dmov      },{1, &tms320c1x_device_base::lt        },{1, &tms320c1x_device_base::ltd       },{1, &tms320c1x_device_base::lta       },{1, &tms320c1x_device_base::mpy       },{1, &tms320c1x_device_base::ldpk      },{1, &tms320c1x_device_base::ldp       },
/*70*/  {1, &tms320c1x_device_base::lark_ar0},{1, &tms320c1x_device_base::lark_ar1  },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*78*/  {1, &tms320c1x_device_base::xor_    },{1, &tms320c1x_device_base::and_      },{1, &tms320c1x_device_base::or_       },{1, &tms320c1x_device_base::lst       },{1, &tms320c1x_device_base::sst       },{3, &tms320c1x_device_base::tblw      },{1, &tms320c1x_device_base::lack      },{0, &tms320c1x_device_base::opcodes_7F    },
/*80*/  {1, &tms320c1x_device_base::mpyk    },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },
/*88*/  {1, &tms320c1x_device_base::mpyk    },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },
/*90*/  {1, &tms320c1x_device_base::mpyk    },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },
/*98*/  {1, &tms320c1x_device_base::mpyk    },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },{1, &tms320c1x_device_base::mpyk      },
/*A0*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*A8*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*B0*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*B8*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*C0*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*C8*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*D0*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*D8*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*E0*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*E8*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*F0*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{1, &tms320c1x_device_base::banz      },{1, &tms320c1x_device_base::bv        },{1, &tms320c1x_device_base::bioz      },{0, &tms320c1x_device_base::illegal   },
/*F8*/  {2, &tms320c1x_device_base::call    },{2, &tms320c1x_device_base::br        },{1, &tms320c1x_device_base::blz       },{1, &tms320c1x_device_base::blez      },{1, &tms320c1x_device_base::bgz       },{1, &tms320c1x_device_base::bgez      },{1, &tms320c1x_device_base::bnz       },{1, &tms320c1x_device_base::bz        }
};

template <int HighBits>
const typename tms320c1x_device_base<HighBits>::tms320c1x_opcode tms320c1x_device_base<HighBits>::s_opcode_7F[32]=
{
/*80*/  {1, &tms320c1x_device_base::nop     },{1, &tms320c1x_device_base::dint      },{1, &tms320c1x_device_base::eint      },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*88*/  {1, &tms320c1x_device_base::abst    },{1, &tms320c1x_device_base::zac       },{1, &tms320c1x_device_base::rovm      },{1, &tms320c1x_device_base::sovm      },{2, &tms320c1x_device_base::cala      },{2, &tms320c1x_device_base::ret       },{1, &tms320c1x_device_base::pac       },{1, &tms320c1x_device_base::apac      },
/*90*/  {1, &tms320c1x_device_base::spac    },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },
/*98*/  {0, &tms320c1x_device_base::illegal },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   },{2, &tms320c1x_device_base::push      },{2, &tms320c1x_device_base::pop       },{0, &tms320c1x_device_base::illegal   },{0, &tms320c1x_device_base::illegal   }
};

template <int HighBits>
int tms320c1x_device_base<HighBits>::add_branch_cycle()
{
	return s_opcode_main[m_opcode.b.h].cycles;
}

/****************************************************************************
 *  Inits CPU emulation
 ****************************************************************************/

